print("Проверка 'интерпритатора' Питон")
print(10 / (5-3))
print((6 / 2)*(8 / 2))
print ('домашнее задание - прочитать "гамлет"')
print("""звезда 
по "имени" 
"солнце" """)
# Эта программа показывает какое сейчас время
print ('15:58')
print("Запорожье") #показывает место проживания
width = 10
length = 5
print(width)
print(length)
длина = 10
print(длина)
#Эта строка показывает где я
квартира = 142
print('Я нахожусь "в" квартире')
print(квартира)
#Сздать 2 переменные: Предельная скорость и дистанция
Предельная_скорость = 160
Дистанция = 300
#Показать значения на которые ссылаются переменные
print('Предельная скорость состовляет')
print(Предельная_скорость)
print('Пройденное расстояние состовляет')
print(Дистанция)
#Эта переменная покажет гдя я
квартире = 142
print('Я нахожусь в квартире номер', квартире)
гривна = 50
print('У меня на карте было', гривна, "гривен")
гривна = 1000
print('А теперь у меня там', гривна, "гривен")
print(30//4)
type(1)
type(1.0)
имя = "Артем"
фамилия = "Стрельников"
print('Меня зовут',имя, фамилия)
print('Artem')
print(9%4)
print('v'*4)
pay = 100
time = 9
many = pay*time
print('Ваша зп состовила:', many)
начальная_цена = float(input('Введите исходную цену: '))
скидка = начальная_цена * 0.2
итоговая_цена = начальная_цена - скидка
print("Отпускная цена состоавляет: ", итоговая_цена)
объем_продаж = float(input('Какой ваш итоговый объем продаж: '))
print('Ваш объем продаж состовил', объем_продаж)

# Узнать нашу среднюю оценку
оценка1 = float(input('Виедите 1ю оценку: '))
оценка2 = float(input('Ввведите 2ю оценку: '))
оценка3 = float(input('Введите 3ю оценку: '))
средняя_оценка = (оценка1 + оценка2 + оценка3) / 3
print('Ваша средняя оценка состовляет', средняя_оценка, "баллов")

temp = float(input("Vvedi temp: "))
if not (temp>5):
    print('ok')
else:
    print('not good: ')

print('good evening')

